// 1. Илья
//     like() {
//         this.isLiked = !this.isLiked;
//     }
// как работает метод?
// сюда же вопросы 7 и 8 - про свойства классов
// сюда же вопрос от Арины про приватные свойства

// 2. Дима 
// сюда же вопрос 9, "как связать попапы и новый класс"
// Не понимаю, как переписать форму добавления карточки на ООП. Она, очевидно, 
// должна создавать объект из экземпляр класса с переданными аргументами,но как именно?
// показать замену composeCard на new Card 
// creatingCards()

// 3. Андрей
// Чем отличаются validity.valid и check.Validity()? В каких случаях что лучше использовать?

// 4. Андрей
// Почему не ищем по document вот так: document.form.formName? 
// Всё на селекторах — из-за БЭМа? Но почему тогда используем id для error в текущей курсовой?

// 5. Андрей
// Как работает сборщик мусора, нужно ли очищать переменные с ними внутри одной функции

// 6. Арина
// Приватный метод ведет на приватное свойство. Можно ли изменить свойство извне?

// 7, 8. Аноним
// Зачем нужен this, чем отличается свойство класса от объявленной переменной

// 9. Антонина
// Как связать попапы и новый класс 

// 10. Можно ли импортировать функции в файлы классов из index.js